{
  "common": {
    "appName": "Girandola",
    "home": "Home",
    "login": "Login",
    "language": "Language",
    "dashboard": "Dashboard",
    "cancel": "Cancel",
    "confirm": "Confirm",
    "saving": "Saving...",
    "success": "Success",
    "error": "Error"
  },
  "home": {
    "title": "Girandola Localizzatore",
    "description": "Track and share your favorite locations"
  },
  "auth": {
    "loginTitle": "Welcome Back",
    "loginDescription": "Sign in to access your Girandolas",
    "signInWithGoogle": "Sign in with Google",
    "signingIn": "Signing in...",
    "loading": "Loading...",
    "signOut": "Sign out",
    "userMenu": "User menu"
  },
  "dashboard": {
    "title": "Dashboard",
    "description": "Your Girandola map will appear here"
  },
  "map": {
    "loading": "Loading map...",
    "errorLoading": "Failed to load map",
    "attribution": "Map data",
    "locateMe": "Show my location",
    "noGpsData": "Tap location to get GPS",
    "switchToSatellite": "Switch to satellite view",
    "switchToMap": "Switch to map view"
  },
  "addGirandola": {
    "button": "Add Girandola",
    "title": "Add New Girandola",
    "description": "Choose how to set the location",
    "useGps": "Use My GPS",
    "useGpsDescription": "Get your current location automatically",
    "pickOnMap": "Pick on Map",
    "pickOnMapDescription": "Tap on the map to place your Girandola",
    "pickOnMapInstruction": "Tap on the map to select location",
    "gettingLocation": "Getting your location...",
    "locationError": "Could not get your location. Please enable GPS or try picking on map.",
    "saveSuccess": "Girandola added successfully!",
    "saveError": "Failed to save Girandola. Please try again.",
    "confirmLocation": "Add Girandola here?",
    "newMarker": "New Girandola",
    "accuracy": "GPS accuracy",
    "accuracyTooLow": "must be under 10m"
  },
  "export": {
    "button": "Export CSV",
    "exporting": "Exporting...",
    "noData": "No data to export",
    "pageTitle": "Export Data",
    "pageDescription": "Export your Girandolas to a CSV file",
    "girandolasCount": "Girandolas",
    "readyToExport": "Ready to export"
  },
  "contributors": {
    "title": "Top Contributors",
    "noContributors": "No contributors yet",
    "girandolas": "girandolas",
    "linkText": "Top Contributors"
  },
  "legal": {
    "termsOfService": "Terms of Service",
    "privacyPolicy": "Privacy Policy"
  },
  "webar": {
    "findGirandola": "Find Girandola"
  },
  "terms": {
    "title": "Terms of Service",
    "lastUpdated": "Last updated: January 17, 2026",
    "section1Title": "1. Acceptance of Terms",
    "section1Content": "By accessing and using Girandola Localizzatore (\"the Service\"), you accept and agree to be bound by the terms and provisions of this agreement.",
    "section2Title": "2. Description of Service",
    "section2Content": "Girandola Localizzatore is a location tracking application that allows users to mark and share points of interest (\"Girandolas\"). The Service requires user authentication via Google OAuth and uses GPS location data.",
    "section3Title": "3. User Accounts",
    "section3Content": "To use the Service, you must sign in with a Google account. You are responsible for maintaining the security of your account. You must not use the Service for any illegal or unauthorized purpose.",
    "section4Title": "4. Location Data",
    "section4Content": "By using the Service, you grant us permission to collect and store your GPS location data when you add Girandolas. This data is associated with your user account and may be visible to other users of the Service.",
    "section5Title": "5. User Content",
    "section5Content": "You retain ownership of any location data you submit to the Service. By submitting data, you grant us a worldwide, non-exclusive license to use, store, and display this data as part of the Service.",
    "section6Title": "6. Prohibited Conduct",
    "section6Content": "You agree not to: (a) use the Service for any unlawful purpose; (b) attempt to gain unauthorized access to the Service; (c) interfere with the proper functioning of the Service; (d) submit false or misleading location data.",
    "section7Title": "7. Disclaimer of Warranties",
    "section7Content": "The Service is provided \"as is\" without warranties of any kind, either express or implied. We do not guarantee that the Service will be uninterrupted, secure, or error-free.",
    "section8Title": "8. Limitation of Liability",
    "section8Content": "In no event shall Girandola Localizzatore be liable for any indirect, incidental, special, or consequential damages arising out of or in connection with your use of the Service.",
    "section9Title": "9. Changes to Terms",
    "section9Content": "We reserve the right to modify these terms at any time. Continued use of the Service after changes constitutes acceptance of the modified terms.",
    "section10Title": "10. Contact",
    "section10Content": "For questions about these Terms of Service, please contact us through our GitHub repository."
  },
  "privacy": {
    "title": "Privacy Policy",
    "lastUpdated": "Last updated: January 17, 2026",
    "section1Title": "1. Information We Collect",
    "section1Content": "We collect the following information: (a) Account information from your Google account (name, email, profile picture); (b) GPS location data when you add Girandolas; (c) Timestamps of when Girandolas are created.",
    "section2Title": "2. How We Use Your Information",
    "section2Content": "We use your information to: (a) Provide and maintain the Service; (b) Display your Girandolas on the map; (c) Show you in the Top Contributors list; (d) Allow you to export your location data.",
    "section3Title": "3. Information Sharing",
    "section3Content": "Your location data (GPS coordinates and timestamps) are visible to all users of the Service. Your email address is visible only to you. We do not sell your personal information to third parties.",
    "section4Title": "4. Data Storage",
    "section4Content": "Your data is stored securely in a Neon Postgres database. Location data includes latitude, longitude, creation timestamp, and association with your user ID.",
    "section5Title": "5. Third-Party Services",
    "section5Content": "We use the following third-party services: (a) Google OAuth for authentication; (b) OpenStreetMap for map display (via Leaflet); (c) Neon for database hosting; (d) Vercel for web hosting.",
    "section6Title": "6. Your Rights",
    "section6Content": "You have the right to: (a) Export your location data via the CSV export feature; (b) Delete your account and associated data by contacting us; (c) Revoke Google OAuth access through your Google account settings.",
    "section7Title": "7. Location Permissions",
    "section7Content": "On Android, the app requests ACCESS_FINE_LOCATION permission to access GPS. This permission is only used when you explicitly choose \"Use My GPS\" to add a Girandola. You can revoke this permission in Android settings.",
    "section8Title": "8. Cookies and Tracking",
    "section8Content": "We use session cookies for authentication via NextAuth.js. These cookies are essential for the Service to function and are deleted when you sign out.",
    "section9Title": "9. Changes to Privacy Policy",
    "section9Content": "We may update this Privacy Policy from time to time. We will notify users of significant changes by updating the \"Last updated\" date.",
    "section10Title": "10. Contact",
    "section10Content": "For privacy-related questions or to request data deletion, please contact us through our GitHub repository."
  }
}
