{
  "common": {
    "appName": "Girandola",
    "home": "Home",
    "login": "Accedi",
    "language": "Lingua",
    "dashboard": "Dashboard",
    "cancel": "Annulla",
    "confirm": "Conferma",
    "saving": "Salvataggio...",
    "success": "Successo",
    "error": "Errore"
  },
  "home": {
    "title": "Girandola Localizzatore",
    "description": "Traccia e condividi i tuoi luoghi preferiti"
  },
  "auth": {
    "loginTitle": "Bentornato",
    "loginDescription": "Accedi per vedere le tue Girandole",
    "signInWithGoogle": "Accedi con Google",
    "signingIn": "Accesso in corso...",
    "loading": "Caricamento...",
    "signOut": "Esci",
    "userMenu": "Menu utente"
  },
  "dashboard": {
    "title": "Dashboard",
    "description": "La mappa delle tue Girandole apparirà qui"
  },
  "map": {
    "loading": "Caricamento mappa...",
    "errorLoading": "Impossibile caricare la mappa",
    "attribution": "Dati mappa",
    "locateMe": "Mostra la mia posizione",
    "noGpsData": "Tocca posizione per GPS"
  },
  "addGirandola": {
    "button": "Aggiungi Girandola",
    "title": "Aggiungi Nuova Girandola",
    "description": "Scegli come impostare la posizione",
    "useGps": "Usa il Mio GPS",
    "useGpsDescription": "Ottieni la tua posizione automaticamente",
    "pickOnMap": "Scegli sulla Mappa",
    "pickOnMapDescription": "Tocca sulla mappa per posizionare la tua Girandola",
    "pickOnMapInstruction": "Tocca sulla mappa per selezionare la posizione",
    "gettingLocation": "Ottenendo la tua posizione...",
    "locationError": "Impossibile ottenere la posizione. Abilita il GPS o prova a scegliere sulla mappa.",
    "saveSuccess": "Girandola aggiunta con successo!",
    "saveError": "Impossibile salvare la Girandola. Riprova.",
    "confirmLocation": "Aggiungere Girandola qui?",
    "newMarker": "Nuova Girandola",
    "accuracy": "Precisione GPS",
    "accuracyTooLow": "deve essere sotto 10m"
  },
  "export": {
    "button": "Esporta CSV",
    "exporting": "Esportazione...",
    "noData": "Nessun dato da esportare",
    "pageTitle": "Esporta Dati",
    "pageDescription": "Esporta le tue Girandole in un file CSV",
    "girandolasCount": "Girandole",
    "readyToExport": "Pronto per l'esportazione"
  },
  "contributors": {
    "title": "Top Contributori",
    "noContributors": "Nessun contributore ancora",
    "girandolas": "girandole",
    "linkText": "Top Contributori"
  },
  "legal": {
    "termsOfService": "Termini di Servizio",
    "privacyPolicy": "Informativa sulla Privacy"
  },
  "terms": {
    "title": "Termini di Servizio",
    "lastUpdated": "Ultimo aggiornamento: 17 gennaio 2026",
    "section1Title": "1. Accettazione dei Termini",
    "section1Content": "Accedendo e utilizzando Girandola Localizzatore (\"il Servizio\"), accetti e acconsenti di essere vincolato dai termini e dalle disposizioni di questo accordo.",
    "section2Title": "2. Descrizione del Servizio",
    "section2Content": "Girandola Localizzatore è un'applicazione di tracciamento della posizione che consente agli utenti di segnare e condividere punti di interesse (\"Girandole\"). Il Servizio richiede l'autenticazione dell'utente tramite Google OAuth e utilizza dati di posizione GPS.",
    "section3Title": "3. Account Utente",
    "section3Content": "Per utilizzare il Servizio, devi accedere con un account Google. Sei responsabile del mantenimento della sicurezza del tuo account. Non devi utilizzare il Servizio per scopi illegali o non autorizzati.",
    "section4Title": "4. Dati di Posizione",
    "section4Content": "Utilizzando il Servizio, ci concedi il permesso di raccogliere e memorizzare i tuoi dati di posizione GPS quando aggiungi Girandole. Questi dati sono associati al tuo account utente e possono essere visibili ad altri utenti del Servizio.",
    "section5Title": "5. Contenuti Utente",
    "section5Content": "Mantieni la proprietà di tutti i dati di posizione che invii al Servizio. Inviando i dati, ci concedi una licenza mondiale e non esclusiva per utilizzare, memorizzare e visualizzare questi dati come parte del Servizio.",
    "section6Title": "6. Condotta Proibita",
    "section6Content": "Accetti di non: (a) utilizzare il Servizio per scopi illeciti; (b) tentare di ottenere accesso non autorizzato al Servizio; (c) interferire con il corretto funzionamento del Servizio; (d) inviare dati di posizione falsi o fuorvianti.",
    "section7Title": "7. Esclusione di Garanzie",
    "section7Content": "Il Servizio è fornito \"così com'è\" senza garanzie di alcun tipo, espresse o implicite. Non garantiamo che il Servizio sarà ininterrotto, sicuro o privo di errori.",
    "section8Title": "8. Limitazione di Responsabilità",
    "section8Content": "In nessun caso Girandola Localizzatore sarà responsabile per danni indiretti, incidentali, speciali o consequenziali derivanti da o in connessione con l'uso del Servizio.",
    "section9Title": "9. Modifiche ai Termini",
    "section9Content": "Ci riserviamo il diritto di modificare questi termini in qualsiasi momento. L'uso continuato del Servizio dopo le modifiche costituisce accettazione dei termini modificati.",
    "section10Title": "10. Contatti",
    "section10Content": "Per domande su questi Termini di Servizio, contattaci attraverso il nostro repository GitHub."
  },
  "privacy": {
    "title": "Informativa sulla Privacy",
    "lastUpdated": "Ultimo aggiornamento: 17 gennaio 2026",
    "section1Title": "1. Informazioni che Raccogliamo",
    "section1Content": "Raccogliamo le seguenti informazioni: (a) Informazioni dell'account dal tuo account Google (nome, email, immagine del profilo); (b) Dati di posizione GPS quando aggiungi Girandole; (c) Timestamp di quando le Girandole vengono create.",
    "section2Title": "2. Come Utilizziamo le Tue Informazioni",
    "section2Content": "Utilizziamo le tue informazioni per: (a) Fornire e mantenere il Servizio; (b) Visualizzare le tue Girandole sulla mappa; (c) Mostrarti nella lista dei Top Contributori; (d) Permetterti di esportare i tuoi dati di posizione.",
    "section3Title": "3. Condivisione delle Informazioni",
    "section3Content": "I tuoi dati di posizione (coordinate GPS e timestamp) sono visibili a tutti gli utenti del Servizio. Il tuo indirizzo email è visibile solo a te. Non vendiamo le tue informazioni personali a terze parti.",
    "section4Title": "4. Archiviazione dei Dati",
    "section4Content": "I tuoi dati sono archiviati in modo sicuro in un database Neon Postgres. I dati di posizione includono latitudine, longitudine, timestamp di creazione e associazione con il tuo ID utente.",
    "section5Title": "5. Servizi di Terze Parti",
    "section5Content": "Utilizziamo i seguenti servizi di terze parti: (a) Google OAuth per l'autenticazione; (b) OpenStreetMap per la visualizzazione della mappa (tramite Leaflet); (c) Neon per l'hosting del database; (d) Vercel per l'hosting web.",
    "section6Title": "6. I Tuoi Diritti",
    "section6Content": "Hai il diritto di: (a) Esportare i tuoi dati di posizione tramite la funzione di esportazione CSV; (b) Eliminare il tuo account e i dati associati contattandoci; (c) Revocare l'accesso OAuth di Google tramite le impostazioni del tuo account Google.",
    "section7Title": "7. Permessi di Posizione",
    "section7Content": "Su Android, l'app richiede il permesso ACCESS_FINE_LOCATION per accedere al GPS. Questo permesso viene utilizzato solo quando scegli esplicitamente \"Usa il Mio GPS\" per aggiungere una Girandola. Puoi revocare questo permesso nelle impostazioni Android.",
    "section8Title": "8. Cookie e Tracciamento",
    "section8Content": "Utilizziamo cookie di sessione per l'autenticazione tramite NextAuth.js. Questi cookie sono essenziali per il funzionamento del Servizio e vengono eliminati quando esci.",
    "section9Title": "9. Modifiche all'Informativa sulla Privacy",
    "section9Content": "Potremmo aggiornare questa Informativa sulla Privacy di tanto in tanto. Notificheremo gli utenti di modifiche significative aggiornando la data \"Ultimo aggiornamento\".",
    "section10Title": "10. Contatti",
    "section10Content": "Per domande relative alla privacy o per richiedere la cancellazione dei dati, contattaci attraverso il nostro repository GitHub."
  }
}
